package edu.project1.text;

public interface Text {
    String greetingsMsg();

    String incorrectLanguageMsg();

    String incorrectLetterInputMsg();

    String chooseLangMsg();

    String iterGuessMsg();

    String guessWrongMsg();

    String guessCorrectMsg();

    String iterStepMsg(String guessedWord, int mistake, int maxMistakes);

    default String winMsg() {
        return """

            ██████████████████████████████████████████████████████████
            █░░░░░░██████████░░░░░░█░░░░░░░░░░█░░░░░░██████████░░░░░░█
            █░░▄▀░░██████████░░▄▀░░█░░▄▀▄▀▄▀░░█░░▄▀░░░░░░░░░░██░░▄▀░░█
            █░░▄▀░░██████████░░▄▀░░█░░░░▄▀░░░░█░░▄▀▄▀▄▀▄▀▄▀░░██░░▄▀░░█
            █░░▄▀░░██████████░░▄▀░░███░░▄▀░░███░░▄▀░░░░░░▄▀░░██░░▄▀░░█
            █░░▄▀░░██░░░░░░██░░▄▀░░███░░▄▀░░███░░▄▀░░██░░▄▀░░██░░▄▀░░█
            █░░▄▀░░██░░▄▀░░██░░▄▀░░███░░▄▀░░███░░▄▀░░██░░▄▀░░██░░▄▀░░█
            █░░▄▀░░██░░▄▀░░██░░▄▀░░███░░▄▀░░███░░▄▀░░██░░▄▀░░██░░▄▀░░█
            █░░▄▀░░░░░░▄▀░░░░░░▄▀░░███░░▄▀░░███░░▄▀░░██░░▄▀░░░░░░▄▀░░█
            █░░▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀░░█░░░░▄▀░░░░█░░▄▀░░██░░▄▀▄▀▄▀▄▀▄▀░░█
            █░░▄▀░░░░░░▄▀░░░░░░▄▀░░█░░▄▀▄▀▄▀░░█░░▄▀░░██░░░░░░░░░░▄▀░░█
            █░░░░░░██░░░░░░██░░░░░░█░░░░░░░░░░█░░░░░░██████████░░░░░░█
            ██████████████████████████████████████████████████████████
            """;
    }

    default String looseMsg() {
        return """

            █████████████████████████████
            █▄─▄███─▄▄─█─▄▄─█─▄▄▄▄█▄─▄▄─█
            ██─██▀█─██─█─██─█▄▄▄▄─██─▄█▀█
            ▀▄▄▄▄▄▀▄▄▄▄▀▄▄▄▄▀▄▄▄▄▄▀▄▄▄▄▄▀
            """;
    }

    String againMsg();

    String incorrectAgainMsg();

    String exitMsg();

    String abnormalExitMsg();

    default String rusLanguageDisclaimer() {
        return "Помните, что сменив язык, вы не меняете загаданные слова. Словарь содержит слова только на\n"
               + "английском языке; вводите символы английского алфавита. Спасибо за внимание!";
    }
}
